; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v8 - type_3 ?v1 - type_1)
 	      (pred_3 ?v5 - object ?v1 - type_1)
	      (pred_1 ?v8 - type_3 ?v6 - type_2)
	      (pred_2 ?v8 - type_3 ?v5 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v8 - type_3 ?v7 ?v2 - type_1)
       :precondition (and  (pred_4 ?v8 ?v7))
       :effect (and  (pred_4 ?v8 ?v2)
		     (not (pred_4 ?v8 ?v7))))

   (:action op_3
       :parameters (?v8 - type_3 ?v3 - object ?v4 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v4) (pred_4 ?v8 ?v4) (pred_1 ?v8 ?v6))
       :effect (and (pred_2 ?v8 ?v3 ?v6)
		    (not (pred_3 ?v3 ?v4)) 
		    (not (pred_1 ?v8 ?v6))))

   (:action op_1
       :parameters (?v8 - type_3 ?v3 - object ?v4 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v3 ?v6) (pred_4 ?v8 ?v4))
       :effect (and (pred_3 ?v3 ?v4)
		    (pred_1 ?v8 ?v6)
		    (not (pred_2 ?v8 ?v3 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_11 - type_3
obj_12 obj_10 obj_05 obj_01 - type_2
obj_02 obj_14 obj_13 obj_07 - type_1
obj_06 obj_03 obj_08 obj_09 - object)
(:init
(pred_4 obj_04 obj_13)
(pred_1 obj_04 obj_12)
(pred_1 obj_04 obj_10)
(pred_4 obj_11 obj_02)
(pred_1 obj_11 obj_05)
(pred_1 obj_11 obj_01)
(pred_3 obj_06 obj_02)
(pred_3 obj_03 obj_13)
(pred_3 obj_08 obj_07)
(pred_3 obj_09 obj_14)
)
(:goal
(and
(pred_3 obj_06 obj_02)
(pred_3 obj_03 obj_14)
(pred_3 obj_08 obj_13)
(pred_3 obj_09 obj_07)
)
)

(:constraints
  (always (not (pred_4 obj_04 obj_14)))
)
)

; plan
1. (op_3 obj_04 obj_03 obj_13 obj_10)
   deleted: (pred_3 obj_03 obj_13) (pred_1 obj_04 obj_10)
   added: (pred_2 obj_04 obj_03 obj_10)
   goals met: 1 of 4
2. (op_2 obj_11 obj_02 obj_14)
   deleted: (pred_4 obj_11 obj_02)
   added: (pred_4 obj_11 obj_14)
   goals met: 1 of 4
3. (op_3 obj_11 obj_09 obj_14 obj_01)
   deleted: (pred_3 obj_09 obj_14) (pred_1 obj_11 obj_01)
   added: (pred_2 obj_11 obj_09 obj_01)
   goals met: 1 of 4
4. (op_2 obj_11 obj_14 obj_07)
   deleted: (pred_4 obj_11 obj_14)
   added: (pred_4 obj_11 obj_07)
   goals met: 1 of 4
5. (op_1 obj_11 obj_09 obj_07 obj_01)
   deleted: (pred_2 obj_11 obj_09 obj_01)
   added: (pred_3 obj_09 obj_07) (pred_1 obj_11 obj_01)
   goals met: 2 of 4
6. (op_3 obj_11 obj_08 obj_07 obj_01)
   deleted: (pred_3 obj_08 obj_07) (pred_1 obj_11 obj_01)
   added: (pred_2 obj_11 obj_08 obj_01)
   goals met: 2 of 4
7. (op_2 obj_11 obj_07 obj_13)
   deleted: (pred_4 obj_11 obj_07)
   added: (pred_4 obj_11 obj_13)
   goals met: 2 of 4
8. (op_1 obj_11 obj_08 obj_13 obj_01)
   deleted: (pred_2 obj_11 obj_08 obj_01)
   added: (pred_3 obj_08 obj_13) (pred_1 obj_11 obj_01)
   goals met: 3 of 4
9. (op_1 obj_04 obj_03 obj_13 obj_10)
   deleted: (pred_2 obj_04 obj_03 obj_10)
   added: (pred_3 obj_03 obj_13) (pred_1 obj_04 obj_10)
   goals met: 3 of 4
10. (op_3 obj_11 obj_03 obj_13 obj_01)
   deleted: (pred_3 obj_03 obj_13) (pred_1 obj_11 obj_01)
   added: (pred_2 obj_11 obj_03 obj_01)
   goals met: 3 of 4
11. (op_2 obj_11 obj_13 obj_14)
   deleted: (pred_4 obj_11 obj_13)
   added: (pred_4 obj_11 obj_14)
   goals met: 3 of 4
12. (op_1 obj_11 obj_03 obj_14 obj_01)
   deleted: (pred_2 obj_11 obj_03 obj_01)
   added: (pred_3 obj_03 obj_14) (pred_1 obj_11 obj_01)
   goals met: 4 of 4
